/****************************************************************************
 *
 * MODULE :Application Main header file
 *
 * CREATED:2016/01/05 03:20:00
 * AUTHOR :Nakanohito
 *
 * DESCRIPTION:アプリケーション特有の基本的な処理を実装
 *
 * CHANGE HISTORY:
 *
 * LAST MODIFIED BY:
 *
 ****************************************************************************
 * Copyright (c) 2016, Nakanohito
 * This software is released under the BSD 2-Clause License.
 * http://opensource.org/licenses/BSD-2-Clause
 ****************************************************************************/
#ifndef APP_MAIN_H_INCLUDED
#define APP_MAIN_H_INCLUDED

#if defined __cplusplus
extern "C" {
#endif

/****************************************************************************/
/***        Include files                                                 ***/
/****************************************************************************/
#include "ToCoNet.h"

/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/

/****************************************************************************/
/***        Type Definitions                                              ***/
/****************************************************************************/
// Application Event
typedef enum {
	E_EVENT_APP_EMPTY = ToCoNet_EVENT_APP_BASE,
	E_EVENT_APP_SECOND,
	E_EVENT_APP_CHK_TIMER,
	E_EVENT_APP_LCD_DRAWING,
	E_EVENT_APP_MELODY_PLAY,
	E_EVENT_APP_MELODY_OK,
	E_EVENT_APP_MELODY_NG,
	E_EVENT_APP_PROCESS,
	E_EVENT_APP_HASH_ST,
	E_EVENT_APP_RX_MSG_CHK
} teAppEvent;

/****************************************************************************/
/***        Local Function Prototypes                                     ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Variables                                            ***/
/****************************************************************************/

/****************************************************************************/
/***        Local Variables                                               ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Functions                                            ***/
/****************************************************************************/
// ハードウェア初期処理
PUBLIC void vInitHardware(bool_t bWarmStart);
// イベント処理：アプリケーション開始
PUBLIC void vEventStartup(tsEvent *pEv, teEvent eEvent, uint32 u32evarg);
// システムコントロールの割り込み処理
PUBLIC uint8 u8EventSysCtrl(uint32 u32DeviceId, uint32 u32ItemBitmap);

/****************************************************************************/
/***        Local Functions                                               ***/
/****************************************************************************/

#if defined __cplusplus
}
#endif

#endif  /* APP_EVENT_H_INCLUDED */

/****************************************************************************/
/***        END OF FILE                                                   ***/
/****************************************************************************/
