/****************************************************************************
 *
 * MODULE :SHA256 functions header file
 *
 * CREATED:2015/04/25 08:32:00
 * AUTHOR :Nakanohito
 *
 * DESCRIPTION:SHA256のハッシュコードを生成する関数群
 *             SHA256 functions (header file)
 *
 * CHANGE HISTORY:
 *
 * LAST MODIFIED BY:
 *
 ****************************************************************************
 * Copyright (c) 2015, Nakanohito
 * This software is released under the BSD 2-Clause License.
 * http://opensource.org/licenses/BSD-2-Clause
 ****************************************************************************/
#ifndef SHA256_H_INCLUDED
#define SHA256_H_INCLUDED

#if defined __cplusplus
extern "C" {
#endif

/****************************************************************************/
/***        Include files                                                 ***/
/****************************************************************************/

/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/

/****************************************************************************/
/***        Type Definitions                                              ***/
/****************************************************************************/
/**
 * ハッシュコード演算の中間状態値
 */
typedef struct {
	// ハッシュ値
	uint32 u32Hash[8];
	// メッセージブロック
	uint8 u8MsgBlock[64];
	// メッセージブロックの編集済みバイト数
	uint32 u32MsgBlockIdx;
	// メッセージ文字数（処理済みメッセージブロック分も含む）
	uint32 u32MsgLen;
} SHA256_state;

/****************************************************************************/
/***        Exported Variables                                            ***/
/****************************************************************************/

/****************************************************************************/
/***        Local Variables                                               ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Functions                                            ***/
/****************************************************************************/
/**
 * ハッシュコード演算の中間状態値初期化処理
 */
PUBLIC SHA256_state sSHA256_newState();

/**
 *	ハッシュコードに変換するメッセージを追加する
 *	@param psState ハッシュコード生成処理ステータス情報
 *	@param pu8Msg 追加メッセージの先頭のポインタ
 *	@param u32Len	追加メッセージの長さ
 */
PUBLIC void vSHA256_append(SHA256_state *psState, const uint8 *pu8Msg, uint32 u32Len);

/**
 * Appendされたメッセージからハッシュコードの生成処理
 *
 *	@param psState ハッシュコード生成処理ステータス情報
 *	@param pu8Hash 結果を代入する配列へのポインタ(256bit必要です)
 */
PUBLIC void vSHA256_generateHash(SHA256_state *psState, uint8 *pu8Hash);

/****************************************************************************/
/***        Local Functions                                               ***/
/****************************************************************************/


#if defined __cplusplus
}
#endif

#endif  /* SHA256_H_INCLUDED */

/****************************************************************************/
/***        END OF FILE                                                   ***/
/****************************************************************************/
