/****************************************************************************
 *
 * MODULE :Timer Utility functions header file
 *
 * CREATED:2015/03/22 21:52:00
 * AUTHOR :Nakanohito
 *
 * DESCRIPTION:
 *   Timer接続機能を提供するユーティリティ関数群
 *   Timer Utility functions (header file)
 *
 * CHANGE HISTORY:
 *
 * LAST MODIFIED BY:
 *
 ****************************************************************************
 * Copyright (c) 2015, Nakanohito
 * This software is released under the BSD 2-Clause License.
 * http://opensource.org/licenses/BSD-2-Clause
 ****************************************************************************/
#ifndef  TIMER_UTIL_H_INCLUDED
#define  TIMER_UTIL_H_INCLUDED

#if defined __cplusplus
extern "C" {
#endif

/****************************************************************************/
/***        Include files                                                 ***/
/****************************************************************************/

/****************************************************************************/
/***        Macro Definitions                                             ***/
/****************************************************************************/
/** １秒あたりのクロック数 */
#define TIMER_UTIL_TIMER_CLOCK_RATE  (16000000)
/** １秒あたりのクロック数 */
#define TIMER_UTIL_TICK_REFLESH_RATE (64000)
/** Tick Timerの１マイクロ秒あたりのクロック数 */
#define TIMER_UTIL_TICK_PER_USEC     (16)

/****************************************************************************/
/***        Type Definitions                                              ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Variables                                            ***/
/****************************************************************************/

/****************************************************************************/
/***        Local Variables                                               ***/
/****************************************************************************/

/****************************************************************************/
/***        Local Function Prototypes                                     ***/
/****************************************************************************/

/****************************************************************************/
/***        Exported Functions                                            ***/
/****************************************************************************/
// Tick Timer 初期化処理
void vTimerUtil_initTick();
// Watch Dog Timer 初期化処理
PUBLIC void vTimerUtil_initWatchDog(uint32 u32TimeOutMsec);
// Tick Timer 処理待ち（ミリ秒単位）
PUBLIC uint32 u32TimerUtil_waitTickMSec(uint32 u32Msec);
// Tick Timer 処理待ち（マイクロ秒単位）
PUBLIC uint32 u32TimerUtil_waitTickUSec(uint32 u32Usec);
// Tick Timer 待ち合わせ処理
PUBLIC uint32 u32TimerUtil_waitUntil(uint64 u64JoinUsec);
// 現在時刻（マイクロ秒単位）取得処理
PUBLIC uint64 u64TimerUtil_readUsec();
/****************************************************************************/
/***        Local Functions                                               ***/
/****************************************************************************/

#if defined __cplusplus
}
#endif

#endif  /* TIMER_UTIL_H_INCLUDED */

/****************************************************************************/
/***        END OF FILE                                                   ***/
/****************************************************************************/

